from app import *

# print("Здраствуй путник, эта история поведает тебе о молодом мальчике")
# time.sleep(4)
# print("...")
# time.sleep(1)
# print("Жизнь которого наполнилась ужасом и кровью....")
# time.sleep(2)
# print("после того как омерзительный правитель земли Ариган на его глазах...")
# time.sleep(4)
# print("убил его отца...")
# time.sleep(2)
# print('\n___________________________________________________________________')
# print("Введи свое имя и выбери свой класс путник ... Hero/Human/Dark/Hunter")
# print('___________________________________________________________________')

world_1 = World('World', 1)

world_1.join_to_world()

i = 0
print('Загрузка мира...')
while i < 10:
    i += 1
    time.sleep(2)
    print('.')

world_1.start_play()

world_1.drow_table()